package homeWork;

public class mathLibraryHomeWork1 {
	  public static void main(String[] args) {
//			Задание 1: Генерация случайного числа в диапазоне
//			Условие:
//			Напишите программу, которая генерирует случайное число:
//
//			От 30 до 130.
//			От 300 до 500.
		  
		  
		  System.out.println( (int) (Math.random() *100)+30);
		  System.out.println( (int) (Math.random() *200)+300);

			
			
	  }
	
	
}
