package homeWork;

public class mathLibraryHomeWork3 {

	  public static void main(String[] args) {
//		  Задание 3: Округление чисел
//		  Условие:
//		  Напишите программу, которая:
//
//		  Округляет число 5.7 до ближайшего целого.
//		  Округляет число 4.3 вниз (floor).
//		  Округляет число 6.8 вверх (ceil).
		  
		  
		  System.out.println(Math.round(5.7));
			 
		 
		  System.out.println(Math.floor(4.3));

	
		  System.out.println(Math.ceil(6.1));


		  
		  
		  
	  }
}
