package Generic;

public class Generic {
//	Generic- позваляет нам писать классы и методы которые работают с разными типами данных 
	
//	public class Triple<T, U, V> {
//	    private T first;
//	    private U second;
//	    private V third;
//	}

//	Здесь мы создаём класс Triple с тремя обобщёнными типами:
//
//		T — первый тип данных.
//		U — второй тип данных.
//		V — третий тип данных.
	
//	Это значит, что объект Triple может хранить три значения разных типов. В примере выше это могут быть целое число, строка и число с плавающей точкой.
	
	
	
}
